Repository: yakimchuk/angular-demo-turing
Catalog: src/app/locales/messages.*.xlf
Languages: ru

# toast.error.internal
source: We found the problem, the website may be working unexpectedly
ru: В работе сайта возникла ошибка. Если проблема повторится, попробуйте перезагрузить страницу

# navigator.products.item.more
source: Know more
ru: Подробнее

# navigator.products.item.purchase
source: Buy, {{ product.price | money }}
ru: Купить, {{ product.price | money }}

# navigator.products.item.load.error
source: We cannot load detailed info about this product, please, try again or later
ru: Не удалось загрузить информацию о предложении. Пожалуйста, попробуйте еще раз, или вернитесь позже.

# route.home.caption
source: New magnificent online store!
ru: Новый великолепный интернет-магазин!

# route.home.description
source: Do shopping with pleasure!
ru: Занимайтесь шоппингом с удовольствием!

# route.home.tour.submit
source: Make a tour!
ru: Обзор возможностей интернет-магазина

# route.home.error
source: We encountered problems while loading catalog<br/> Press the button below to try to load this catalog again
ru: Возникла проблема при загрузке каталога предложений.<br/> Нажмите кнопку ниже чтобы еще раз попробовать загрузить каталог.

# route.home.reload
source: Reload catalog
ru: Перезагрузить предложения

# shipping.selector.error.areas
source: Something goes wrong, we cannot find shipping areas
ru: Возникла ошибка, отсутствуют регионы доставки

# shipping.selector.reload.areas
source: Reload shipping areas
ru: Перезагрузить регионы доставки

# shipping.selector.form.selector.area.caption
source: Select your area
ru: Выберите регион доставки

# shipping.selector.hint.areas
source: Where do you want to receive your order?
ru: Где вы хотите получить ваш заказ?

# shipping.selector.error.variants
source: Something goes wrong, we cannot find shipping variants to the selected area
ru: Возникла ошибка, отсутствуют способы доставки в выбранный вами регион. Попробуйте выбрать другой регион доставки.

# shipping.selector.form.selector.variant.caption
source: Select shipping variant
ru: Выберите способ доставки

# shipping.selector.hint.variants
source: How do you want to receive your order?
ru: Как вы хотите получить ваш заказ?

# shipping.selector.note
source: If you do not see your area or suitable shipping option, please contact us at shipping@turing-demo.world
ru: Если вы не обнаружили подходящего способа доставки, сообщите нам об этом на почту shipping@turing-demo.world

# popup.auth.login.caption
source: Sign In
ru: Вход

# form.field.email
source: E-Mail
ru: Электронная почта

# form.field.password
source: Password
ru: Пароль

# popup.auth.login.submit
source: Sign In
ru: Войти

# popup.auth.registration.caption
source: Sign Up
ru: Регистрация

# form.field.username
source: Username
ru: Имя пользователя (логин)

# popup.auth.registration.submit
source: Sign Up
ru: Зарегистрироваться

# popup.auth.toast.login.success
source: You have been successfully singed in
ru: Вы успешно вошли в личный кабинет

# popup.auth.toast.login.error.unknown
source: We cannot authorize you at this time, please try again or later
ru: Не удалось войти в личный кабинет (ошибка). Пожалуйста, повторите попытку или вернитесь позже.

# popup.auth.toast.login.error.invalid
source: Such combination of email and password is not found, please check entered data
ru: Не удалось найти такой комбинации имени пользователя и пароля. Проверьте введенные данные.

# popup.auth.toast.registration.success
source: You have been successfully registered
ru: Вы успешно зарегистрировались

# popup.auth.toast.registration.error.unknown
source: We cannot register you at this time, please try again or later
ru: Не удалось произвести регистрацию (ошибка). Пожалуйста, попробуйте еще раз или вернитесь позже.

# popup.auth.toast.registration.error.used
source: This email is already in use, please use other one or sign in using the left form
ru: Этот адрес электронной почты уже использовался для регистрации. Укажите другой адрес электронной почты.

# popup.auth.toast.registration.error.invalid
source: You have entered incorrect email (incorrect characters)
ru: Вы допустили ошибку в адресе электронной почты.

# route.cart.caption
source: Cart
ru: Корзина

# route.cart.description
source: Your online shopping basket
ru: Ваша онлайн-корзина покупок

# route.cart.clear.submit
source: Clear cart
ru: Очистить корзину

# route.cart.loading
source: We are loading your cart
ru: Мы загружаем вашу корзину

# route.cart.empty.description
source: Cart <b>is empty!</b>
ru: Корзина <b>пуста!</b>

# route.cart.empty.action.submit
source: Begin shopping!
ru: Начать шоппинг!

# route.cart.step.cart.caption
source: Cart
ru: Корзина

# route.cart.step.cart.items.count
source: There are {cart.items.length, plural, one {...} other {...}} in your cart
ru: В вашей корзине {cart.items.length, plural, one {...} other {...}}

source: {VAR_PLURAL, plural, one {one item} other {{{cart.items.length}} items} }
ru: {VAR_PLURAL, plural, one {один товар} few {{{cart.items.length}} товара} other {{{cart.items.length}} товаров} }

# route.cart.subtotal.caption
source: Subtotal
ru: Сумма заказа

# route.cart.step.cart.submit
source: Checkout
ru: Оформить заказ

# route.cart.step.checkout.caption
source: Checkout
ru: Оформление заказа

# route.cart.step.checkout.form.tax.caption
source: Tax
ru: Налог

# route.cart.step.checkout.form.tax.description
source: Please select suitable taxation for your order
ru: Выберите подходящий вариант налогообложения вашего заказа

# route.cart.step.form.shipping.description
source: How you'd like to receive your order?
ru: Как вы хотите получить ваш заказ?

# route.cart.step.checkout.user.description
source: You are logged in as:<br/> <b>{{ user.model?.email }}</b>
ru: Вы вошли как:<br/> <b>{{ user.model?.email }}</b>

# route.cart.step.checkout.submit
source: Confirm order
ru: Подтвердить заказ

# route.cart.step.payment.caption
source: Payment
ru: Оплата

# route.cart.step.payment.error.description
source: We have experienced issues at try to allow you to pay your order.<br/> However, we will try to display you all of your orders.
ru: Возникла проблема при попытке сформировать форму оплаты вашего заказа.<br/> Тем не менее, мы попытаемся дать вам эту возможность найдя ваш заказ вручную.

# route.cart.step.payment.error.noOrder.empty
source: We cannot find any of your unpaid orders. You can open your <a>account</a> and try to find and pay your order manually. Anyway, please write to us to support@turing-demo.world.
ru: Вы не можем найти ни один неоплаченный заказ. Вы можете открыть ваш <a>личный кабинет</a>, попробовать найти ваш заказ вручную и оплатить его (там же). В любом случае, напишите нам на почту support@turing-demo.world

# route.cart.step.payment.error.noOrder.oneFound
source: We found the only one unpaid order, if it is your just confirmed order, you can pay it now. Otherwise please open your <a>account</a> and pay your order, or write to us to support@turing-demo.world to get qualified support.
ru: Мы нашли единственный не оплаченный заказ, и если это только что подтверженный вами заказ, вы можете оплатить его. В противном случае, пожалуйста, откройте ваш <a>личный кабинет</a> и оплатите ваш заказ, или напишите нам на почту support@turing-demo.world чтобы получить квалифицированную помощь.

# route.cart.step.payment.error.noOrder.manyFound
source: We have found many unpaid orders and cannot determine which of them is your just confirmed order. Please, open your <a>account</a> page, then find your order and pay it.
ru: Мы нашли несколько неоплаченных заказов. Пожалуйста, откройте ваш <a>личный кабинет</a>, затем найдите ваш заказ и оплатите его.

# route.cart.step.payment.error.noOrder.manyFound.submit
source: Open your account
ru: Открыть личный кабинет

# route.cart.step.payment.description
source: We have successfully received your order #{{ order?.id }}.<br/> At any time you can manage your orders and account in the <a>account</a> area.
ru: Мы успешно получили ваш заказ №{{ order?.id }}.<br/> Вы можете посмотреть список ваших заказов в любой момент в вашем <a>личном кабинете</a>.

# route.cart.step.done.caption
source: Done
ru: Готово

# route.cart.step.done.error.description
source: We cannot find just paid order, but it seems everything is fine and you paid your order. We will try to show you all of your orders so you can check payment result yourself.
ru: Мы не можем найти только что оплаченный вами заказ, но, судя по всему, всё в порядке и вы оплатили ваш заказ. Мы попробуем показать вам все ваши заказы чтобы вы сами убедились что нами была получена оплата вашего заказа.

# route.cart.step.done.error.notFound
source: We cannot find any of your orders. It seems like you opened this pages accidentally. If you not, then please check your orders manually in your <a>account</a> and write to us to support@turing-demo.world, we will help you.
ru: Мы не можем найти ни один ваш заказ. Очень похоже, что вы случайно открыли эту страницу. Если это не так, тогда проверьте список ваших заказов вручную в вашем <a>личном кабинете</a> и напишите нам на почту support@turing-demo.world, мы поможем вам.

# route.cart.step.done.thanks
source: Thank you for using our online store!
ru: Спасибо что воспользовались нашим интернет-магазином!

# route.cart.step.done.error.submit
source: Back to the catalog
ru: Вернуться в каталог

# route.cart.step.done.description
source: We have successfully received your order and payment. You may track your orders (and know when it was shipped to you) in your <a>account</a> (section "Orders").
ru: Мы успешно получили ваш заказ и оплату. Вы можете отслеживать состояние заказов (и дату отправки) вручную в вашем <a>личном кабинете</a> (в разделе "Заказы").

# route.cart.step.done.submit
source: Back to the catalog
ru: Вернуться в каталог

# route.cart.note.auth
source: Sign in or register in order to continue creation of your order
ru: Войдите или зарегистрируйтесь чтобы подтвердить ваш заказ

# route.cart.toast.order.cancel
source: Order was not confirmed due to canceled authorization
ru: Заказ не был подтвержден из-за отмены входа в личный кабинет

# route.cart.toast.order.error
source: We cannot register your order at this time, please, try again or later
ru: Произошла ошибка при попытке регистрации. Пожалуйста, попробуйте еще раз или вернитесь позже.

# route.cart.toast.reload.error
source: We have registered your order, but we cannot download its data, please, reload the page and open your account
ru: Мы получили ваш заказ, но нам не удалось загрузить информацию о нём. Пожалуйста, перезагрузите страницу и откройте ваш личный кабинет.

# route.cart.toast.order.error.notFound
source: We have registered your order, but we faced some technical errors, please, reload the page and open your account
ru: Мы получили ваш заказ, но возникла техническая проблема. Пожалуйста, перезагрузите страницу и откройте ваш личный кабинет.

# route.cart.toast.order.success
source: You have successfully paid your order
ru: Вы успешно оплатили ваш заказ

# route.cart.toast.payment.error
source: We faced some issues at your try to pay your order, please, try again or later
ru: При оплате вашего заказа возникла проблема. Пожалуйста, попробуйте еще раз или вернитесь позже

# route.account.caption
source: Account
ru: Личный кабинет

# route.account.description
source: Your personal data (orders and information management)
ru: Ваши личные данные (данные для заказов)

# button.logout
source: Logout
ru: Выход

# route.account.error.session
source: Your session has expired, sign in again, please
ru: Вы находились в личном кабинете слишком долго. Пожалуйста, войдите в личный кабинет повторно. Это мера безопасности.

# route.account.error.auth
source: You must sign in in order manage your account
ru: Чтобы управлять вашим профилем нужно войти в личный кабинет

# route.account.auth.submit
source: Sign In
ru: Войти

# route.account.section.profile.caption
source: Profile
ru: Профиль

# route.account.section.shipping.caption
source: Shipping
ru: Доставка

# route.account.section.orders.caption
source: Orders
ru: Заказы

# route.account.toast.logout.success
source: You have successfully logged out from the account
ru: Вы успешно вышли из личного кабинета

# route.account.toast.logout.error
source: Cannot log you out at this time, please try again or later
ru: Не удалось выйти из личного кабинета. Повторите попытку или вернитесь позже.

# route.department.caption
source: {{ department?.name }} T-shirts
ru: Футболки "{{ department?.name }}"

# route.department.error
source: We encountered problems while loading catalog<br/> Press the button below to try to load this catalog again
ru: Возникла проблема при загрузке каталога предложений<br/> Нажмите кнопку ниже чтобы повторить попытку загрузки каталога

# route.department.reload
source: Reload catalog
ru: Перезагрузить каталог

# route.category.caption
source: {{ category?.name }} T-shirts
ru: Футболки "{{ category?.name }}"

# route.category.error
source: We encountered problems while loading catalog<br/> Press the button below to try to load this catalog again
ru: Возникла проблема при загрузке каталога предложений<br/> Нажмите кнопку ниже чтобы повторить попытку загрузки каталога

# route.category.reload
source: Reload catalog
ru: Перезагрузить каталог

# project.name
source: Buy & Try E-Commerce
ru: Интернет-магазин

# navigator.departments.error
source: We cannot load departments list<br/> Please, press the button to try again<br/>
ru: Не удалось выгрузить список разделов магазина<br/> Пожалуйста, нажмите кнопку ниже чтобы повторить попытку<br/>

# navigator.departments.reload
source: Reload departments
ru: Перезагрузить разделы

# website.close
source: Close website
ru: Закрыть сайт

# cart.loading
source: Loading cart
ru: Корзина загружается

# cart.button.error
source: Cart is not available
ru: Корзина недоступна

# cart.button.items.count
source: {{ cart.items?.length }} {cart.items?.length, plural, one {...} other {...}} in your cart
ru: {{ cart.items?.length }} {cart.items?.length, plural, one {...} few {...} other {...}} в вашей корзине

source: {VAR_PLURAL, plural, one {item} other {items} }
ru: {VAR_PLURAL, plural, one {товар} few {товара} other {товаров} }

# breadcrumb.toParent
source: Back
ru: Назад

# route.root.breadcrumb
source: Store
ru: Магазин

# route.home.breadcrumb
source: Catalog
ru: Каталог

# route.cart.breadcrumb
source: Cart
ru: Корзина

# route.account.breadcrumb
source: Account
ru: Личный кабинет

# breadcrumb.unknown
source: Unknown page
ru: Неизвестная страница

# breadcrumb.error
source: Unknown page
ru: Неизвестная страница

# image.error
source: Could not load an image<br/> <b>You can try load this image again by pressing the button below</b>
ru: Не удается загрузить изображение<br/> <b>Вы можете попробовать перезагрузить изображение нажав кнпоку ниже</b>

# image.reload
source: Reload image
ru: Перезагрузить изображение

# order.subtotal.error
source: We could not load data to calculate total price
ru: Не удается загрузить данные для расчета общей стоимости

# order.subtotal.reload
source: Reload
ru: Перезагрузить

# order.subtotal.item.subtotal.caption
source: Cart subtotal
ru: Корзина

# order.subtotal.item.shipping.caption
source: Shipping
ru: Доставка

# tax.selector.error
source: Something goes wrong, we cannot find taxes for your order
ru: Возникла проблема, не удается найти варианты налогообложения для вашего заказа

# tax.selector.reload
source: Reload
ru: Перезагрузить

# tax.selector.form.taxes.caption
source: Taxation option
ru: Вариант налогообложения

# cart.items.column.image
source: Pic.
ru: Изобр.

# cart.items.column.name
source: Name
ru: Название

# cart.items.column.price
source: Price
ru: Цена

# cart.items.column.quantity
source: Quan.
ru: Кол-во

# cart.items.column.subtotal
source: Subt.
ru: Итого

# product.update.quantity.success
source: The product quantity has been updated
ru: Количество товара было успешно изменено

# product.update.quantity.error
source: We unable to update the product quantity at this time
ru: Не удается изменить количество товара

# product.remove.success
source: The product has been removed from your cart
ru: Товар был удален из вашей корзины

# product.remove.error
source: We unable to remove product from your cart at this time
ru: Возникла проблема при удалении товара из вашей корзины

# order.error
source: We cannot show you information about the order at this time.<br/> Please, reopen this page or try later
ru: Не удается отобразить информацию о заказе.<br/> Пожалуйста, перезагрузите страницу или вернитесь позже.

# order.items.column.name
source: Product
ru: Товар

# order.items.column.cost
source: Cost
ru: Цена

# order.items.column.quantity
source: Quantity
ru: Количество

# order.items.column.subtotal
source: Subtotal
ru: Итого

# order.subtotal.note
source: Products + Tax + Shipping
ru: Товары + Налог + Доставка

# order.error.items
source: For some reasons we cannot load list with your ordered items, but do not worry, we know your order contents
ru: По некоторым причинам нам не удается загрузить список заказанных вами товаров, но не беспокойтесь, мы точно знаем состав вашего заказа

# order.message.state.paid
source: Your order has been successfully paid!<br/> Await for delivery, please. Shipping date will be available above.
ru: Ваш заказ был успешно оплачен!<br/> Ожидайте доставки. Дата отправки будет доступна на этой странице.

# order.payment.caption
source: Pay your order #{{ order?.id }}
ru: Оплата вашего заказа #{{ order?.id }}

# order.payment.method.card.caption
source: Credit or debit card
ru: Кредитная или дебетовая карта

# order.payment.method.card.submit
source: Submit Payment
ru: Оплатить заказ

# order.message.state.unknown
source: Your order is in unknown status.<br/> Please send us a message to the email support@turing-demo.world.
ru: Не удается получить статус вашего заказа<br/> Пожалуйста, отправьте сообщение нам на почту support@turing-demo.world.

# order.toast.payment.success
source: Your order has been successfully paid
ru: Ваш заказ был успешно оплачен

# order.toast.payment.error
source: We faced issues at try to process your order
ru: Возникла проблема при обработке вашего заказа

# order.toast.data.reload.error
source: You have paid your order, but we cannot reload it to show you its new status, please, reload the page manually
ru: Вы успешно оплатили ваш заказ, но нам не удается перезагрузить его. Пожалуйста, обновите страницу вручную.

# orders.empty
source: At this moment you did not order anything... <a>Begin shopping?</a>
ru: На данный момент вы еще ничего не заказали... <a>Начать шоппинг?</a>

# orders.items.column.id
source: Number
ru: Номер

# orders.items.column.name
source: Name
ru: Название

# orders.items.column.created
source: Created
ru: Создан

# orders.items.column.shipped
source: Shipped
ru: Отправлен

# orders.items.column.cost
source: Cost
ru: Стоимость

# orders.items.column.status
source: Status
ru: Состояние

# orders.items.column.status.unpaid
source: Unpaid
ru: Не оплачен

# orders.items.column.status.paid
source: Paid
ru: Оплачен

# orders.items.column.status.unknown
source: Unknown
ru: Неизвестно

# form.field.name
source: Name
ru: Название

# form.field.phone.day
source: Day phone
ru: Номер для приема звонков днем

# form.field.hint.phone
source: You can enter number in any format with leading plus
ru: Вы можете ввести номер телефона в любом формате с +7

# form.field.error.pattern.phone
source: You can enter only plus, brackets, numbers and hyphen
ru: Вы можете ввести только плюс, скобки, числа и тире

# form.field.phone.evening
source: Evening phone
ru: Телефон для приема звонков утром

# form.field.phone.primary
source: Primary mobile phone
ru: Контактный мобильный телефон

# profile.editor.personal.form.submit
source: Save
ru: Сохранить

# profile.editor.personal.error
source: For now we cannot find your profile. Did you forget to sign in?
ru: Мы не можем найти ваш профиль. Вы забыли войти в личный кабинет?

# profile.editor.personal.toast.update.error
source: We could not update your profile at this time, please try again or later
ru: Не удалось обновить ваши личные данные. Попробуйте еще раз или вернитесь позже.

# profile.editor.personal.toast.update.success
source: Your profile has been successfully updated
ru: Ваш профиль был успешно изменен

# form.field.address1
source: Address Line 1
ru: Адрес доставки (область, район)

# form.field.address2
source: Address Line 2
ru: Адрес доставки (улица, дом, квартира)

# form.field.city
source: City
ru: Город

# form.field.region
source: Region
ru: Область

# form.field.postalCode
source: Postal code
ru: Индекс

# form.field.country
source: Country
ru: Страна

# profile.editor.shipping.note.address
source: Where do you want to receive your order?
ru: Где бы вы хотели получить ваш заказ?

# profile.editor.shipping.form.submit
source: Save
ru: Сохранить

# profile.editor.shipping.error
source: For now we cannot find your profile. Did you forget to sign in?
ru: Мы не можем обнаружить ваш профиль. Вы забыли войти в личный кабинет?

# profile.editor.shipping.toast.update.error
source: We could not update your shipping details at this time, please try again or later
ru: Не удалось обновить информацию по доставке. Попробуйте еще раз или вернитесь позже.

# profile.editor.shipping.toast.update.success
source: Your shipping details has been successfully updated
ru: Информация о доставке была успешно изменена

# product.purchase.form.caption
source: Construct your T-shirt
ru: Укажите параметры футболки

# product.purchase.form.description
source: Select options for your T-shirt: image, color and other options
ru: Выберите параметры для вашей футболки: изображение, цвет и прочие параметры

# product.purchase.form.step.image.caption
source: Image on T-shirt
ru: Изображение на футболке

# product.purchase.form.step.attribute.caption
source: Select {{ attribute.name }}
ru: Выберите {{ attribute.name }}

# product.purchase.form.submit
source: Add to cart
ru: В корзину

# product.purchase.toast.success
source: The product was added to your cart
ru: Товар был успешно добавлен в вашу корзину

# product.purchase.toast.error
source: We unable to add your product to the cart at this time
ru: Не удалось добавить товар в корзину. Попробуйте еще раз или вернитесь позже.

# home.link
source: Open the catalog
ru: Открыть каталог

# product.reviews.caption
source: Reviews about the product
ru: Отзывы о товаре

# product.reviews.error
source: We cannot load product reviews at this time, please try again or later
ru: Не удалось загрузить отзывы о товаре. Попробуйте еще раз или вернитесь позже.

# product.reviews.reload
source: Reload reviews
ru: Перезагрузить отзывы

# product.reviews.form.review.placeholder
source: Leave a review
ru: Оставьте ваш отзыв

# product.reviews.form.rate.caption
source: Rate this product —
ru: Оцените товар —

# product.reviews.form.submit
source: Send
ru: Отправить

# product.reviews.empty
source: At this time there are no any reviews...
ru: На данный момент отзывы отсутствуют

# product.reviews.toast.post.error
source: We unable to create review at this time, please, try again or later
ru: Не удалось отправить отзыв. Попробуйте еще раз или вернитесь позже.

# product.reviews.toast.post.success
source: Your review has been successfully posted
ru: Ваш отзыв был успешно размещен на сайте

# product.reviews.toast.post.cancel
source: Post was not sent due to canceled authorization
ru: Отправка отзыва была отменена из-за отмены входа в профиль

# product.reviews.note.authentication
source: Please sign in or register in order to post your review
ru: Пожалуйста, войдите или зарегистрируйтесь чтобы отправить ваш отзыв

# search.label
source: Search for T-shirts
ru: Поиск футболок
