Repository: yakimchuk/angular-demo-turing
Catalog: src/app/locales/messages.*.xlf
Languages: ru

# route.product.error
source: We cannot load this offer, please reload the page or open it later
ru: Нам не удалось загрузить информацию о предложении. Пожалуйста, перезагрузите страницу или откройте её позднее.

# route.product.image.note
source: <span>*</span> The real T-shirt may differ from this image.<br/> It is just a sample of the image on T-shirt.
ru: <span>*</span> Заказанная футболка может отличаться от изображения выше.<br/> Выше лишь пример изображения на футболке.

# navigator.departments.caption
source: Departments
ru: Категории товаров

# sidebar.mobile.menu.caption
source: Menu
ru: Меню

# order.subtotal.total
source: {{ order?.cost | money }} in total
ru: Итого {{ order?.cost | money }}

# tour.departments.description
source: This online store is selling T-shirts, and you able to navigate through their categories using this left menu.
ru: Это интернет-магазин по продаже футболок, и вы можете просмотреть их категории используя это меню.

# tour.ending
source: This online store was completed in July 2019 by Roman Yakimchuk (yakimchuk.ry@gmail.com).<br/> Thanks for coming to our online store J
ru: Это демо интернет-магазина было завершено в Июле 2019 года (Роман Якимчук, yakimchuk.ry@gmail.com).<br/> Спасибо по посещение нашего интернет-магазина J

# tour.product.description
source: You may get acquainted with the product. They all are T-shirts, but the images on them are different (this is a T-shirt prints online store). Find the one interested to you, and then add it to your cart or open the details page to learn more about this product.
ru: Вы можете ознакомиться с товаром. Это всё футболки, но изображения на них отличаются (это интернет-магазин по продаже футболок с принтами). Найдите интересующий вас товар и добавьте его в корзину, или откройте страницу с подробной информацией о товаре.

# tour.project.description
source: Welcome to the new <b>high-quality demo</b> for Turing.ly!<br/> <span>It developed with Angular selected as the framework and Google Material as UI Kit.</span>
ru: Добро пожаловать в <b>качественное демо</b> для Turing.ly!<br/> <span>Оно было разработано с использованием Angular и Google Material как библиотекой визуальных компонентов (UI Kit)</span>

# tour.project.description.candidate
source: This application is not a real operating product, it is just a live demo of an online store in order to demonstrate the candidate's technical skills.
ru: Это приложение не является работающим коммерческим решением, это лишь демонстрация интернет-магазина с целью демонстрации технических способностей кандидата.

# tour.products.description
source: Every department or category has an interface to navigate over store/categories contents and select your interested products.
ru: Каждая категория содержит пользовательский интерфейс для навигации и поиска интересующего вас товара.

# route.cart.clear.error
source: Cannot clear your cart at this time. Try do remove items one by one, or try later
ru: Не удалось очистить корзину. Попробуйте вручную удалить все товары из корзины, или повторите попытку позже.

# route.cart.clear.success
source: Your cart has been successfully cleaned
ru: Ваша корзина была успешно очищена

# tour.search.description
source: If you are looking for something in particular, you may also use the global search over the whole T-shirts variants.<br/> This search is predictive so you may access every product from any page of the application.
ru: Если вас интересует какой-то конкретный товар, вы можете использовать глобальный поиск по всем продаваемым вариантам футболок.<br/> Этот поиск является предиктивным, поэтому вы можете открыть любой товар с любой страницы интернет-магазина.

# tour.cart.description
source: When you will select all you need, you may open your cart and proceed to the checkout process and pay order. The most interesting part is an exception handling. Just try to break this checkout process.
ru: Когда вы выберете все интересующие вас товары, откройте вашу корзину и оформите и оплатите заказ. Наиболее интересная часть, это обработка исключительных ситуаций. Просто попробуйте "сломать" процесс оформления или оплаты заказа.
